+posts/lang/java/hashmap.org
#+TITLE: Hash Maps in Java

<<<<<<< HEAD
#+ATTR_HTML: :width 100% class="center"
| Home | Featured Blogs | [[https://github.com/imahajanshubham][GitHub]] |
=======
#+SETUPFILE: ../../../+themes/readtheorg.setup
>>>>>>> 089941baa3b144514581895c2c4fa2031cc34755

* Table of Contents                                       :TOC_4_gh:noexport:
- [[#basics-of-hash-maps][Basics of Hash Maps]]
  - [[#definition][Definition]]
    - [[#but-what-do-we-mean-by-that][But what do we mean by that?]]
    - [[#what-did-we-observed][What did we observed?]]
<<<<<<< HEAD
=======
    - [[#what-did-we-observed-1][What did we observed?]]
>>>>>>> 089941baa3b144514581895c2c4fa2031cc34755
- [[#syntax][Syntax]]
- [[#properties-of-a-hashmap][Properties of a HashMap]]
- [[#a-sample-program][A sample program]]
- [[#the-test-case][The test case]]
- [[#a-humble-solution][A humble solution]]
  - [[#step---1][Step - 1]]
  - [[#step---2][Step - 2]]
  - [[#step---3][Step - 3]]
  - [[#step---4][Step - 4]]
  - [[#step---5][Step - 5]]
<<<<<<< HEAD
  - [[#step---6][Step - 6]]
- [[#thank-you][Thank You!]]

* DONE Basics of Hash Maps

** Definition

Java HashMap is one of the most popular Collection classes in java. Java Hash is Hash table based implementation. HashMap in java extends AbstractMap class
that implement(setq org-hide-emphasis-markers t)  printf("Hello World!\n");
s Map interface.

*** But what do we mean by that?

=======
  - [[#step---5-1][Step - 5]]
  - [[#step---6][Step - 6]]
- [[#thank-you][Thank You!]]

* Basics of Hash Maps
** Definition
Java HashMap is one of the most popular Collection classes in java. Java Hash is
Hash table based implementation. HashMap in java extends AbstractMap class that
implements Map interface.

*** But what do we mean by that?
>>>>>>> 089941baa3b144514581895c2c4fa2031cc34755
Before trying to understand the definition of Hash Map, we should try to understand
the concept behind the Hash Map.

Let’s say we want make a record of a phone-book (person’s name and phone no) as
follows:

<<<<<<< HEAD
#+BEGIN_NOTE
=======
|--------+------------|
| *Name*   |  *Phone No.* |
|--------+------------|
| Raj    | 2345671001 |
| Nisha  | 4464832994 |
| Sonu   | 4858830685 |
| Nitin  | 8739111330 |
| Akshay | 8743193003 |
| Muskan | 9899363086 |
|--------+------------|

#+begin_note
>>>>>>> 089941baa3b144514581895c2c4fa2031cc34755
For the sake of simplicity (to avoid rehashing), let’s assume:

- Each name is unique.
- A single person can have only one phone no.
<<<<<<< HEAD
#+END_NOTE

| *Name* | *Phone No.* |
|--------+-------------|
| Raj    |  2345671001 |
| Nisha  |  4464832994 |
| Sonu   |  4858830685 |
| Nitin  |  8739111330 |
| Akshay |  8743193003 |
| Muskan |  9899363086 |
=======
#+end_note

| *Name*   |  *Phone No.* |
|--------+------------|
| Raj    | 2345671001 |
| Nisha  | 4464832994 |
| Sonu   | 4858830685 |
| Nitin  | 8739111330 |
| Akshay | 8743193003 |
| Muskan | 9899363086 |
>>>>>>> 089941baa3b144514581895c2c4fa2031cc34755

and so on…

Now what we want to do is:
If we say a name, we wanna know his/her phone no.

For ex:

<<<<<<< HEAD
| Input  |        Raj |
| Output | 2345671001 |

*** What did we observed?

=======
|--------+------------|
| Input  |        Raj |
| Output | 2345671001 |
|--------+------------|

*** What did we observed?
- We don’t know the exact no of names/phone-nos.
- So the Hash-Size is not fixed. But there are ways via which we can fix the
  Hash-Size (using constructors).
- The order of the entries (Raj -> Nisha or Nisha -> Raj) doesn’t matter for us
  to fetch their phone nos. So Hash Map doesn’t require sorted input.
- Person’s name (input) is the ~KEY~ to find the ~VALUE~ i.e. phone no. (output) i.e
  *name is mapped with phone no*.
- Instead of phone record, we can create any type of record. So the data-type of
  Keys/Values depends upon the user.

| Input  |        Raj |
| Output | 2345671001 |

