lang/java/hashmap.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-01-28 Sun 11:09 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Hash Maps in Java Hash Maps in Java</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Shubham Mahajan" />
</head>
<body>
<div id="content">
<h1 class="title">Hash Maps in Java Hash Maps in Java</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgf419988">1. Basics of Hash Maps</a>
<ul>
<li><a href="#org3300451">1.1. Definition</a>
<ul>
<li><a href="#org1849fe5">1.1.1. But what do we mean by that?</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org8cebe4c">2. <span class="done DONE">DONE</span> Basics of Hash Maps</a>
<ul>
<li><a href="#orgd5c514e">2.1. Definition</a>
<ul>
<li><a href="#org63865b2">2.1.1. But what do we mean by that?</a></li>
<li><a href="#orgbe68446">2.1.2. What did we observed?</a></li>
<li><a href="#org16c7f30">2.1.3. What did we observed?</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orga56f6dc">3. Syntax</a></li>
<li><a href="#orgf21d3fc">4. <span class="done DONE">DONE</span> Syntax</a></li>
<li><a href="#org7c6555e">5. Properties of a HashMap</a></li>
<li><a href="#org22f5d51">6. <span class="todo TODO">TODO</span> Properties of a HashMap</a></li>
<li><a href="#orgae70ac3">7. A sample program</a></li>
<li><a href="#org1a206e9">8. <span class="done DONE">DONE</span> A sample program</a></li>
<li><a href="#org78eb69b">9. The test case</a></li>
<li><a href="#org76d8f15">10. <span class="done DONE">DONE</span> The test case</a></li>
<li><a href="#org793c2dc">11. A humble solution</a>
<ul>
<li><a href="#orga4e29c1">11.1. Step - 1</a></li>
</ul>
</li>
<li><a href="#org738da92">12. <span class="done DONE">DONE</span> A humble solution</a>
<ul>
<li><a href="#org4d29fcb">12.1. Step - 1</a></li>
<li><a href="#org57edce2">12.2. Step - 2</a></li>
<li><a href="#org8a67cc4">12.3. Step - 3</a></li>
<li><a href="#orgcfa86d3">12.4. Step - 4</a></li>
<li><a href="#org2c0d3f3">12.5. Step - 5</a></li>
<li><a href="#orgd620f14">12.6. Step - 5</a></li>
<li><a href="#org359fa21">12.7. Step - 6</a></li>
<li><a href="#org7ad0b70">12.8. Step - 6</a></li>
</ul>
</li>
<li><a href="#orgb4e6dc1">13. Thank You!</a></li>
</ul>
</div>
</div>
<p>
&lt;&lt;&lt;&lt;&lt;&lt;&lt; HEAD
</p>
<p width="100% class=&quot;center&quot;">
<code>=====</code>
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" width="100% class=&quot;center&quot;">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Home</td>
<td class="org-left">Featured Blogs</td>
<td class="org-left"><a href="https://github.com/imahajanshubham">GitHub</a></td>
</tr>
</tbody>
</table>

<div id="outline-container-orgf419988" class="outline-2">
<h2 id="orgf419988"><span class="section-number-2">1</span> Basics of Hash Maps</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org3300451" class="outline-3">
<h3 id="org3300451"><span class="section-number-3">1.1</span> Definition</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Java HashMap is one of the most popular Collection classes in java. Java Hash is
Hash table based implementation. HashMap in java extends AbstractMap class that
implements Map interface.
</p>
</div>

<div id="outline-container-org1849fe5" class="outline-4">
<h4 id="org1849fe5"><span class="section-number-4">1.1.1</span> But what do we mean by that?</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
Before trying to understand the definition of Hash Map, we should try to
understand the concept behind the Hash Map.
<code>=====</code>
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org8cebe4c" class="outline-2">
<h2 id="org8cebe4c"><span class="section-number-2">2</span> <span class="done DONE">DONE</span> Basics of Hash Maps</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgd5c514e" class="outline-3">
<h3 id="orgd5c514e"><span class="section-number-3">2.1</span> Definition</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Java HashMap is one of the most popular Collection classes in java. Java Hash  printf("Hello World!\n");
Map
is Hash table based implementation. HashMap in java extends AbstractMap class
that implement(setq org-hide-emphasis-markers t)  printf("Hello World!\n");
s Map interface.
</p>
</div>

<div id="outline-container-org63865b2" class="outline-4">
<h4 id="org63865b2"><span class="section-number-4">2.1.1</span> But what do we mean by that?</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
Before trying to understand the definition of Hash Map, we should try to understand
the concept behind the Hash Map.
&gt;&gt;&gt;&gt;&gt;&gt;&gt; 56fa0856f7ac8a3f6ccbb031f887df86ce329ca7
</p>

<p>
Let’s say we want make a record of a phone-book (person’s name and phone no) as
follows:
</p>

<p>
&lt;&lt;&lt;&lt;&lt;&lt;&lt; HEAD
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><b>Name</b></th>
<th scope="col" class="org-right"><b>Phone No.</b></th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Raj</td>
<td class="org-right">2345671001</td>
</tr>

<tr>
<td class="org-left">Nisha</td>
<td class="org-right">4464832994</td>
</tr>

<tr>
<td class="org-left">Sonu</td>
<td class="org-right">4858830685</td>
</tr>

<tr>
<td class="org-left">Nitin</td>
<td class="org-right">8739111330</td>
</tr>

<tr>
<td class="org-left">Akshay</td>
<td class="org-right">8743193003</td>
</tr>

<tr>
<td class="org-left">Muskan</td>
<td class="org-right">9899363086</td>
</tr>
</tbody>
</table>

<p>
<code>=====</code>
</p>
<div class="NOTE">
<p>
For the sake of simplicity (to avoid rehashing), let’s assume:
</p>

<ul class="org-ul">
<li>Each name is unique.</li>
<li>A single person can have only one phone no.</li>
</ul>

</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><b>Name</b></th>
<th scope="col" class="org-right"><b>Phone No.</b></th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Raj</td>
<td class="org-right">2345671001</td>
</tr>

<tr>
<td class="org-left">Nisha</td>
<td class="org-right">4464832994</td>
</tr>

<tr>
<td class="org-left">Sonu</td>
<td class="org-right">4858830685</td>
</tr>

<tr>
<td class="org-left">Nitin</td>
<td class="org-right">8739111330</td>
</tr>

<tr>
<td class="org-left">Akshay</td>
<td class="org-right">8743193003</td>
</tr>

<tr>
<td class="org-left">Muskan</td>
<td class="org-right">9899363086</td>
</tr>
</tbody>
</table>
<p>
&gt;&gt;&gt;&gt;&gt;&gt;&gt; 56fa0856f7ac8a3f6ccbb031f887df86ce329ca7
</p>

<p>
and so on…
</p>

<p>
Now what we want to do is:
If we say a name, we wanna know his/her phone no.
</p>

<p>
For ex:
</p>

<p>
&lt;&lt;&lt;&lt;&lt;&lt;&lt; HEAD
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Input</td>
<td class="org-right">Raj</td>
</tr>

<tr>
<td class="org-left">Output</td>
<td class="org-right">2345671001</td>
</tr>
</tbody>
</table>
</div>
</div>
