+posts/lang/java/hashmap.md

# Table of Contents

1.  [Basics of Hash Maps](#org29005ff)
    1.  [Definition](#orga99846d)
        1.  [But what do we mean by that?](#orga28835b)
        2.  [What did we observed?](#org706b1bf)
2.  [Syntax](#orge6525e8)
3.  [Properties of a HashMap](#orga47a5fe)
4.  [A sample program](#orga082e24)
5.  [The test case](#org4833985)
6.  [A humble solution](#org3df976e)
    1.  [Step - 1](#orgc0ef6b1)
    2.  [Step - 2](#org11a6224)
    3.  [Step - 3](#org41d6111)
    4.  [Step - 4](#org6683ec8)
    5.  [Step - 5](#org2bdb882)
    6.  [Step - 6](#org863291f)
7.  [Thank You!](#orgecc7f31)

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" width="100% class=&quot;center&quot;">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Home</td>
<td class="org-left">Featured Blogs</td>
<td class="org-left">[GitHub](https://github.com/imahajanshubham)</td>
</tr>
</tbody>
</table>


<a id="org29005ff"></a>

# DONE Basics of Hash Maps


<a id="orga99846d"></a>

## Definition

Java HashMap is one of the most popular Collection classes in java. Java Hash  printf("Hello World!\n");
Map
is Hash table based implementation. HashMap in java extends AbstractMap class
that implement(setq org-hide-emphasis-markers t)  printf("Hello World!\n");
s Map interface.


<a id="orga28835b"></a>

### But what do we mean by that?

Before trying to understand the definition of Hash Map, we should try to understand
the concept behind the Hash Map.

Let’s say we want make a record of a phone-book (person’s name and phone no) as
follows:

<div class="NOTE">
For the sake of simplicity (to avoid rehashing), let’s assume:

-   Each name is unique.
-   A single person can have only one phone no.

</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">**Name**</th>
<th scope="col" class="org-right">**Phone No.**</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">Raj</td>
<td class="org-right">2345671001</td>
</tr>


<tr>
<td class="org-left">Nisha</td>
<td class="org-right">4464832994</td>
</tr>


<tr>
<td class="org-left">Sonu</td>
<td class="org-right">4858830685</td>
</tr>


<tr>
<td class="org-left">Nitin</td>
<td class="org-right">8739111330</td>
</tr>


<tr>
<td class="org-left">Akshay</td>
<td class="org-right">8743193003</td>
</tr>


<tr>
<td class="org-left">Muskan</td>
<td class="org-right">9899363086</td>
</tr>
</tbody>
</table>

and so on…

Now what we want to do is:
If we say a name, we wanna know his/her phone no.

For ex:

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Input</td>
<td class="org-right">Raj</td>
</tr>


<tr>
<td class="org-left">Output</td>
<td class="org-right">2345671001</td>
</tr>
</tbody>
</table>
