+posts/lang/java/hashmap.org
*** What did we observed?
>>>>>>> 089941baa3b144514581895c2c4fa2031cc34755
- We don’t know the exact no of names/phone-nos.

#+begin_tip
The no of entries (name/phone no) in the Hash Map is called *Hash-Size*.
#+end_tip

So the Hash-Size is not fixed. But there are ways via which we can fix the
Hash-Size (using constructors).

- The order of the entries (Raj -> Nisha or Nisha -> Raj) doesn’t matter for us
  to fetch their phone nos. So Hash Map doesn’t require sorted input.
- Person’s name (input) is the ~KEY~ to find the ~VALUE~ i.e. phone no. (output)
  i.e *name is mapped with phone no*.
- Instead of phone record, we can create any type of record. So the data-type of
  Keys/Values depends upon the user.
- Each ~Name - phone no~ is in the form of pair similar to ~Key - Value~.

Till know, we came to understand a little-bit about something known as
Hash-Size, Keys and Values. Now let’s try to understand more about Hash Map in
technical terms.

<<<<<<< HEAD
* DONE Syntax

=======
* Syntax
>>>>>>> 089941baa3b144514581895c2c4fa2031cc34755
In Java, the HashMap class’ object is declared as follows:

#+begin_src java
Map<Key, Value> obj = new HashMap<Key, Value>();
#+end_src

For ex:

#+begin_src java
Map<String, Integer> record1 = new HashMap<String, Integer>();
Map<String, String> record2 = new HashMap<String, String>();
#+end_src

<<<<<<< HEAD
* TODO Properties of a HashMap

=======
* Properties of a HashMap
>>>>>>> 089941baa3b144514581895c2c4fa2031cc34755
- HashMap is denoted as ~HashMap<Key, Value>~.
- No need to specify the size of HashMap.
- No need of sorted input.
- Neither it sorts the stored input.
- Similar to ~Hashtable~ class except it permits null values and keys.
- You need to import ~java.util.HashMap~ class in order to use the HashMap class
  and its methods.

<<<<<<< HEAD
#+begin_note
There are a lot many other important properties too such:
- Rehashing
- Load Factor
- Various methods.
  
But we will study all these and others during our lifelong journey ♥.
#+end_note

* DONE A sample program

=======
* A sample program
>>>>>>> 089941baa3b144514581895c2c4fa2031cc34755
What better way to understand more than to learn it by implementation? With that
spirit, let’s try to make a program in java to implement a phonebook
as follows:

1) Get ’n’ (~INTEGER~ value) from the user, denoting the no of entries/records
   to be filled in the phonebook.
2) Now, get ’n’ no of names-phoneno (~STRING-INTEGER~) space separated pairs from the user.

   For ex:

  | Raj 34745910  |
  | Sonu 86988901 |
  | Ravi 87240393 |

3) Get unknown no of names (~STRING~) from the user and for each of the these
   names, print:

| If name is present in the phonebook | *name=phoneno* |
| If name is not present              | *Not found*    |

<<<<<<< HEAD
