lang/java/hashmap.html

<div id="outline-container-orgbe68446" class="outline-4">
<h4 id="orgbe68446"><span class="section-number-4">2.1.2</span> What did we observed?</h4>
<div class="outline-text-4" id="text-2-1-2">
<ul class="org-ul">
<li>We don’t know the exact no of names/phone-nos.</li>
<li>So the Hash-Size is not fixed. But there are ways via which we can fix the Hash-Size (using constructors).</li>
<li>The order of the entries (Raj -&gt; Nisha or Nisha -&gt; Raj) doesn’t matter for us to fetch their phone nos. So Hash Map doesn’t require sorted input.</li>
<li>Person’s name (input) is the <code>KEY</code> to find the <code>VALUE</code> i.e. phone no. (output) i.e <b>name is mapped with phone no</b>.</li>
<li>Instead of phone record, we can create any type of record. So the data-type of Keys/Values depends upon the user.</li>
</ul>
<p>
<code>=====</code>
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Input</td>
<td class="org-right">Raj</td>
</tr>

<tr>
<td class="org-left">Output</td>
<td class="org-right">2345671001</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org16c7f30" class="outline-4">
<h4 id="org16c7f30"><span class="section-number-4">2.1.3</span> What did we observed?</h4>
<div class="outline-text-4" id="text-2-1-3">
<ul class="org-ul">
<li>We don’t know the exact no of names/phone-nos.</li>
</ul>

<div class="tip">
<p>
The no of entries (name/phone no) in the Hash Map is called <b>Hash-Size</b>.
</p>

</div>

<p>
So the Hash-Size is not fixed. But there are ways via which we can fix the
Hash-Size (using constructors).
</p>

<ul class="org-ul">
<li>The order of the entries (Raj -&gt; Nisha or Nisha -&gt; Raj) doesn’t matter for us
to fetch their phone nos. So Hash Map doesn’t require sorted input.</li>
<li>Person’s name (input) is the <code>KEY</code> to find the <code>VALUE</code> i.e. phone no. (output)
i.e <b>name is mapped with phone no</b>.</li>
<li>Instead of phone record, we can create any type of record. So the data-type of
Keys/Values depends upon the user.</li>
</ul>
<p>
&gt;&gt;&gt;&gt;&gt;&gt;&gt; 56fa0856f7ac8a3f6ccbb031f887df86ce329ca7
</p>
<ul class="org-ul">
<li>Each <code>Name - phone no</code> is in the form of pair similar to <code>Key - Value</code>.</li>
</ul>

<p>
Till know, we came to understand a little-bit about something known as
Hash-Size, Keys and Values. Now let’s try to understand more about Hash Map in
technical terms.
</p>

<p>
&lt;&lt;&lt;&lt;&lt;&lt;&lt; HEAD
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-orga56f6dc" class="outline-2">
<h2 id="orga56f6dc"><span class="section-number-2">3</span> Syntax</h2>
<div class="outline-text-2" id="text-3">
<p>
<code>=====</code>
</p>
</div>
</div>
<div id="outline-container-orgf21d3fc" class="outline-2">
<h2 id="orgf21d3fc"><span class="section-number-2">4</span> <span class="done DONE">DONE</span> Syntax</h2>
<div class="outline-text-2" id="text-4">
<p>
&gt;&gt;&gt;&gt;&gt;&gt;&gt; 56fa0856f7ac8a3f6ccbb031f887df86ce329ca7
In Java, the HashMap class’ object is declared as follows:
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #ce537a; font-weight: bold;">Map</span><span style="color: #4f97d7;">&lt;</span><span style="color: #ce537a; font-weight: bold;">Key</span>, <span style="color: #ce537a; font-weight: bold;">Value</span><span style="color: #4f97d7;">&gt;</span> <span style="color: #7590db;">obj</span> = <span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">HashMap</span><span style="color: #4f97d7;">&lt;</span><span style="color: #ce537a; font-weight: bold;">Key</span>, <span style="color: #ce537a; font-weight: bold;">Value</span><span style="color: #4f97d7;">&gt;()</span>;
</pre>
</div>

<p>
For ex:
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #ce537a; font-weight: bold;">Map</span><span style="color: #4f97d7;">&lt;</span><span style="color: #ce537a; font-weight: bold;">String</span>, <span style="color: #ce537a; font-weight: bold;">Integer</span><span style="color: #4f97d7;">&gt;</span> <span style="color: #7590db;">record1</span> = <span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">HashMap</span><span style="color: #4f97d7;">&lt;</span><span style="color: #ce537a; font-weight: bold;">String</span>, <span style="color: #ce537a; font-weight: bold;">Integer</span><span style="color: #4f97d7;">&gt;()</span>;
<span style="color: #ce537a; font-weight: bold;">Map</span><span style="color: #4f97d7;">&lt;</span><span style="color: #ce537a; font-weight: bold;">String</span>, <span style="color: #ce537a; font-weight: bold;">String</span><span style="color: #4f97d7;">&gt;</span> <span style="color: #7590db;">record2</span> = <span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">HashMap</span><span style="color: #4f97d7;">&lt;</span><span style="color: #ce537a; font-weight: bold;">String</span>, <span style="color: #ce537a; font-weight: bold;">String</span><span style="color: #4f97d7;">&gt;()</span>;
</pre>
</div>

<p>
&lt;&lt;&lt;&lt;&lt;&lt;&lt; HEAD
</p>
</div>
</div>
<div id="outline-container-org7c6555e" class="outline-2">
<h2 id="org7c6555e"><span class="section-number-2">5</span> Properties of a HashMap</h2>
<div class="outline-text-2" id="text-5">
<p>
<code>=====</code>
</p>
</div>
</div>
<div id="outline-container-org22f5d51" class="outline-2">
<h2 id="org22f5d51"><span class="section-number-2">6</span> <span class="todo TODO">TODO</span> Properties of a HashMap</h2>
<div class="outline-text-2" id="text-6">
<p>
&gt;&gt;&gt;&gt;&gt;&gt;&gt; 56fa0856f7ac8a3f6ccbb031f887df86ce329ca7
</p>
<ul class="org-ul">
<li>HashMap is denoted as <code>HashMap&lt;Key, Value&gt;</code>.</li>
<li>No need to specify the size of HashMap.</li>
<li>No need of sorted input.</li>
<li>Neither it sorts the stored input.</li>
<li>Similar to <code>Hashtable</code> class except it permits null values and keys.</li>
<li>You need to import <code>java.util.HashMap</code> class in order to use the HashMap class
and its methods.</li>
</ul>

<p>
&lt;&lt;&lt;&lt;&lt;&lt;&lt; HEAD
</p>
</div>
</div>
<div id="outline-container-orgae70ac3" class="outline-2">
<h2 id="orgae70ac3"><span class="section-number-2">7</span> A sample program</h2>
<div class="outline-text-2" id="text-7">
<p>
What better way to understand more than to learn it by implementation? With that
spirit, let’s try to make a program in java to implement a phonebook as follows:
</p>

<ol class="org-ol">
<li>Get ’n’ (<code>INTEGER</code> value) from the user, denoting the no of entries/records to
be filled in the phonebook.</li>
<li>Now, get ’n’ no of names-phoneno (<code>STRING-INTEGER</code>) space separated pairs from
the user.</li>
</ol>
<p>
<code>=====</code>
</p>
<div class="note">
<p>
There are a lot many other important properties too such:
</p>
<ul class="org-ul">
<li>Rehashing</li>
<li>Load Factor</li>
<li>Various methods.</li>
</ul>

<p>
But we will study all these and others during our lifelong journey ♥.
</p>

</div>
</div>
</div>

<div id="outline-container-org1a206e9" class="outline-2">
<h2 id="org1a206e9"><span class="section-number-2">8</span> <span class="done DONE">DONE</span> A sample program</h2>
<div class="outline-text-2" id="text-8">
<p>
What better way to understand more than to learn it by implementation? With that
spirit, let’s try to make a program in java to implement a phonebook
as follows:
</p>

<ol class="org-ol">
<li>Get ’n’ (<code>INTEGER</code> value) from the user, denoting the no of entries/records
to be filled in the phonebook.</li>
<li>Now, get ’n’ no of names-phoneno (<code>STRING-INTEGER</code>) space separated pairs from the user.</li>
</ol>
<p>
&gt;&gt;&gt;&gt;&gt;&gt;&gt; 56fa0856f7ac8a3f6ccbb031f887df86ce329ca7
</p>

<p>
For ex:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Raj 34745910</td>
</tr>

<tr>
<td class="org-left">Sonu 86988901</td>
</tr>

<tr>
<td class="org-left">Ravi 87240393</td>
</tr>
</tbody>
</table>

<ol class="org-ol">
<li>Get unknown no of names (<code>STRING</code>) from the user and for each of the these
names, print:</li>
</ol>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">If name is present in the phonebook</td>
<td class="org-left"><b>name=phoneno</b></td>
</tr>

<tr>
<td class="org-left">If name is not present</td>
<td class="org-left"><b>Not found</b></td>
</tr>
</tbody>
</table>

<p>
&lt;&lt;&lt;&lt;&lt;&lt;&lt; HEAD
</p>
</div>
</div>
