+posts/lang/java/hashmap.md


<a id="org706b1bf"></a>

### What did we observed?

-   We don’t know the exact no of names/phone-nos.

<div class="tip">
The no of entries (name/phone no) in the Hash Map is called **Hash-Size**.

</div>

So the Hash-Size is not fixed. But there are ways via which we can fix the
Hash-Size (using constructors).

-   The order of the entries (Raj -> Nisha or Nisha -> Raj) doesn’t matter for us
    to fetch their phone nos. So Hash Map doesn’t require sorted input.
-   Person’s name (input) is the `KEY` to find the `VALUE` i.e. phone no. (output)
    i.e **name is mapped with phone no**.
-   Instead of phone record, we can create any type of record. So the data-type of
    Keys/Values depends upon the user.
-   Each `Name - phone no` is in the form of pair similar to `Key - Value`.

Till know, we came to understand a little-bit about something known as
Hash-Size, Keys and Values. Now let’s try to understand more about Hash Map in
technical terms.


<a id="orge6525e8"></a>

# DONE Syntax

In Java, the HashMap class’ object is declared as follows:

    Map<Key, Value> obj = new HashMap<Key, Value>();

For ex:

    Map<String, Integer> record1 = new HashMap<String, Integer>();
    Map<String, String> record2 = new HashMap<String, String>();


<a id="orga47a5fe"></a>

# TODO Properties of a HashMap

-   HashMap is denoted as `HashMap<Key, Value>`.
-   No need to specify the size of HashMap.
-   No need of sorted input.
-   Neither it sorts the stored input.
-   Similar to `Hashtable` class except it permits null values and keys.
-   You need to import `java.util.HashMap` class in order to use the HashMap class
    and its methods.

<div class="note">
There are a lot many other important properties too such:

-   Rehashing
-   Load Factor
-   Various methods.

But we will study all these and others during our lifelong journey ♥.

</div>


<a id="orga082e24"></a>

# DONE A sample program

What better way to understand more than to learn it by implementation? With that
spirit, let’s try to make a program in java to implement a phonebook
as follows:

1.  Get ’n’ (`INTEGER` value) from the user, denoting the no of entries/records
    to be filled in the phonebook.
2.  Now, get ’n’ no of names-phoneno (`STRING-INTEGER`) space separated pairs from the user.
    
    For ex:
    
    <table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
    
    
    <colgroup>
    <col  class="org-left" />
    </colgroup>
    <tbody>
    <tr>
    <td class="org-left">Raj 34745910</td>
    </tr>
    
    
    <tr>
    <td class="org-left">Sonu 86988901</td>
    </tr>
    
    
    <tr>
    <td class="org-left">Ravi 87240393</td>
    </tr>
    </tbody>
    </table>

3.  Get unknown no of names (`STRING`) from the user and for each of the these
    names, print:

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">If name is present in the phonebook</td>
<td class="org-left">**name=phoneno**</td>
</tr>


<tr>
<td class="org-left">If name is not present</td>
<td class="org-left">**Not found**</td>
</tr>
</tbody>
</table>
