+posts/lang/java/hashmap.org
* DONE The test case

=======
* The test case
>>>>>>> 089941baa3b144514581895c2c4fa2031cc34755
Input:

| 3             |
| Raj 34745910  |
| Sonu 86988901 |
| Ravi 87240393 |
| Raju          |
| Ravi          |

Output:

| Not found     |
| Ravi=87240393 |

<<<<<<< HEAD
* DONE A humble solution

** Step - 1

=======
* A humble solution
** Step - 1
>>>>>>> 089941baa3b144514581895c2c4fa2031cc34755
Let’s create testMain class with main function and initialize ~Scanner~ and ~Map~
classes:

#+begin_src java
  import java.util.*;
  import java.io.*;

  class testMain {
    public static void main(String []args) {
      Map<String, Integer> phoneBook = new HashMap<String, Integer>();
      Scanner scan = new Scanner(System.in);
    }
  }    
#+end_src

** Step - 2
<<<<<<< HEAD

Now let’s get the value of ’n’ (~INTEGER~) i.e. the no of phone records to be entered:
=======
Now let’s get the value of ’n’ (~INTEGER~) i.e. the no of phone records to be
entered:
>>>>>>> 089941baa3b144514581895c2c4fa2031cc34755

#+begin_src java
  int n = scan.nextInt();
#+end_src

** Step - 3
<<<<<<< HEAD

Now let’s fill ’n’ records (~STRING INTEGER~) in the phonebook.

#+begin_src java
=======
Now let’s fill ’n’ records (~STRING-INTEGER~) in the phonebook.

#+begin_src java
  int n = scan.nextInt();
  
>>>>>>> 089941baa3b144514581895c2c4fa2031cc34755
  for(int i = 0; i < n; i++){
    String name = scan.next();
    int phone = scan.nextInt();

    phoneBook.put(name, phone);
  }
#+end_src

#+begin_tip
To put the data (name, phoneno) in the HashMap/phonebook, ~put()~ method is used.

*Syntax:*
       ~put(Key, Value)~
#+end_tip

** Step - 4
<<<<<<< HEAD

=======
>>>>>>> 089941baa3b144514581895c2c4fa2031cc34755
Now comes a little tricky part:

3. Get unknown no of names (~STRING~) from the user and for each of the these
   names, print:

| If name is present in the phonebook | *name=phoneno* |
| If name is not present              | *Not found*    |

Let’s to do it one-by-one:

- get unknown no of names (~STRING~).

#+begin_src java
<<<<<<< HEAD
while(scan.hasNext()) {
  String s = scan.next();
}
#+end_src

** Step - 5

=======
  while(scan.hasNext()) {
    String s = scan.next();
  }
#+end_src

** Step - 5
- print the required output.

#+begin_src java
  while (scan.hasNext()) {
    String s = scan.next();
    Integer phoneNumber = phoneBook.get(s);

    System.out.println((phoneNumber != null) ? s + "=" + phoneNumber
                                             : "Not found");
  }
#+end_src

