lang/java/hashmap.html
<div id="outline-container-org78eb69b" class="outline-2">
<h2 id="org78eb69b"><span class="section-number-2">9</span> The test case</h2>
<div class="outline-text-2" id="text-9">
<p>
<code>=====</code>
</p>
</div>
</div>
<div id="outline-container-org76d8f15" class="outline-2">
<h2 id="org76d8f15"><span class="section-number-2">10</span> <span class="done DONE">DONE</span> The test case</h2>
<div class="outline-text-2" id="text-10">
<p>
&gt;&gt;&gt;&gt;&gt;&gt;&gt; 56fa0856f7ac8a3f6ccbb031f887df86ce329ca7
Input:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">3</td>
</tr>

<tr>
<td class="org-left">Raj 34745910</td>
</tr>

<tr>
<td class="org-left">Sonu 86988901</td>
</tr>

<tr>
<td class="org-left">Ravi 87240393</td>
</tr>

<tr>
<td class="org-left">Raju</td>
</tr>

<tr>
<td class="org-left">Ravi</td>
</tr>
</tbody>
</table>

<p>
Output:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Not found</td>
</tr>

<tr>
<td class="org-left">Ravi=87240393</td>
</tr>
</tbody>
</table>

<p>
&lt;&lt;&lt;&lt;&lt;&lt;&lt; HEAD
</p>
</div>
</div>
<div id="outline-container-org793c2dc" class="outline-2">
<h2 id="org793c2dc"><span class="section-number-2">11</span> A humble solution</h2>
<div class="outline-text-2" id="text-11">
</div>
<div id="outline-container-orga4e29c1" class="outline-3">
<h3 id="orga4e29c1"><span class="section-number-3">11.1</span> Step - 1</h3>
<div class="outline-text-3" id="text-11-1">
<p>
Let’s create testMain class with main function and initialize <code>Scanner</code> and <code>Map</code>
classes:
</p>

<p>
<code>=====</code>
</p>
</div>
</div>
</div>
<div id="outline-container-org738da92" class="outline-2">
<h2 id="org738da92"><span class="section-number-2">12</span> <span class="done DONE">DONE</span> A humble solution</h2>
<div class="outline-text-2" id="text-12">
</div>
<div id="outline-container-org4d29fcb" class="outline-3">
<h3 id="org4d29fcb"><span class="section-number-3">12.1</span> Step - 1</h3>
<div class="outline-text-3" id="text-12-1">
<p>
Let’s create testMain class with main function and initialize <code>Scanner</code> and <code>Map</code>
classes:
</p>


<p>
&gt;&gt;&gt;&gt;&gt;&gt;&gt; 56fa0856f7ac8a3f6ccbb031f887df86ce329ca7
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #4f97d7; font-weight: bold;">import</span> <span style="color: #a45bad;">java</span>.<span style="color: #a45bad;">util</span>.*;
<span style="color: #4f97d7; font-weight: bold;">import</span> <span style="color: #a45bad;">java</span>.<span style="color: #a45bad;">io</span>.*;

<span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">testMain</span> <span style="color: #4f97d7;">{</span>
  <span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #4f97d7; font-weight: bold;">static</span> <span style="color: #ce537a; font-weight: bold;">void</span> <span style="color: #bc6ec5; font-weight: bold;">main</span><span style="color: #bc6ec5;">(</span><span style="color: #ce537a; font-weight: bold;">String</span> <span style="color: #2d9574;">[]</span><span style="color: #7590db;">args</span><span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
    <span style="color: #ce537a; font-weight: bold;">Map</span><span style="color: #2d9574;">&lt;</span><span style="color: #ce537a; font-weight: bold;">String</span>, <span style="color: #ce537a; font-weight: bold;">Integer</span><span style="color: #2d9574;">&gt;</span> <span style="color: #7590db;">phoneBook</span> = <span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">HashMap</span><span style="color: #2d9574;">&lt;</span><span style="color: #ce537a; font-weight: bold;">String</span>, <span style="color: #ce537a; font-weight: bold;">Integer</span><span style="color: #2d9574;">&gt;()</span>;
    <span style="color: #ce537a; font-weight: bold;">Scanner</span> <span style="color: #7590db;">scan</span> = <span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">Scanner</span><span style="color: #2d9574;">(</span>System.in<span style="color: #2d9574;">)</span>;
  <span style="color: #bc6ec5;">}</span>
<span style="color: #4f97d7;">}</span>    
</pre>
</div>
</div>
</div>

<div id="outline-container-org57edce2" class="outline-3">
<h3 id="org57edce2"><span class="section-number-3">12.2</span> Step - 2</h3>
<div class="outline-text-3" id="text-12-2">
<p>
&lt;&lt;&lt;&lt;&lt;&lt;&lt; HEAD
Now let’s get the value of ’n’ (<code>INTEGER</code>) i.e. the no of phone records to be
entered:
<code>=====</code>
</p>

<p>
Now let’s get the value of ’n’ (<code>INTEGER</code>) i.e. the no of phone records to be entered:
&gt;&gt;&gt;&gt;&gt;&gt;&gt; 56fa0856f7ac8a3f6ccbb031f887df86ce329ca7
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">n</span> = scan.nextInt<span style="color: #4f97d7;">()</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-org8a67cc4" class="outline-3">
<h3 id="org8a67cc4"><span class="section-number-3">12.3</span> Step - 3</h3>
<div class="outline-text-3" id="text-12-3">
<p>
&lt;&lt;&lt;&lt;&lt;&lt;&lt; HEAD
Now let’s fill ’n’ records (<code>STRING-INTEGER</code>) in the phonebook.
</p>

<div class="org-src-container">
<pre class="src src-java">  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">n</span> = scan.nextInt<span style="color: #4f97d7;">()</span>;

=======

Now let&#8217;s fill &#8217;n&#8217; records <span style="color: #4f97d7;">(</span>~STRING INTEGER~<span style="color: #4f97d7;">)</span> in the phonebook.

#+begin_src java
&gt;&gt;&gt;&gt;&gt;&gt;&gt; <span style="color: #a45bad;">56fa0856f7ac8a3f6ccbb031f887df86ce329ca7</span>
  <span style="color: #4f97d7; font-weight: bold;">for</span><span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">i</span> = <span style="color: #a45bad;">0</span>; i &lt; <span style="color: #ce537a; font-weight: bold;">n</span>; i++<span style="color: #4f97d7;">){</span>
    <span style="color: #ce537a; font-weight: bold;">String</span> <span style="color: #7590db;">name</span> = scan.next<span style="color: #bc6ec5;">()</span>;
    <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">phone</span> = scan.nextInt<span style="color: #bc6ec5;">()</span>;

    phoneBook.put<span style="color: #bc6ec5;">(</span>name, phone<span style="color: #bc6ec5;">)</span>;
  <span style="color: #4f97d7;">}</span>
</pre>
</div>

<p>
&lt;&lt;&lt;&lt;&lt;&lt;&lt; HEAD
<b>Note:</b> To put the data (name, phoneno) in the HashMap/phonebook, <code>put()</code> method is
used.
</p>

<p>
Syntax: <code>put(Key, Value)</code>
</p>

<p>
<code>=====</code>
&gt;&gt;&gt;&gt;&gt;&gt;&gt; 56fa0856f7ac8a3f6ccbb031f887df86ce329ca7
</p>
<div class="tip">
<p>
To put the data (name, phoneno) in the HashMap/phonebook, <code>put()</code> method is used.
</p>

<p>
<b>Syntax:</b>
       <code>put(Key, Value)</code>
</p>

</div>
</div>
</div>

<div id="outline-container-orgcfa86d3" class="outline-3">
<h3 id="orgcfa86d3"><span class="section-number-3">12.4</span> Step - 4</h3>
<div class="outline-text-3" id="text-12-4">
<p>
&lt;&lt;&lt;&lt;&lt;&lt;&lt; HEAD
<code>=====</code>
</p>

<p>
&gt;&gt;&gt;&gt;&gt;&gt;&gt; 56fa0856f7ac8a3f6ccbb031f887df86ce329ca7
Now comes a little tricky part:
</p>

<ol class="org-ol">
<li>Get unknown no of names (<code>STRING</code>) from the user and for each of the these
names, print:</li>
</ol>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">If name is present in the phonebook</td>
<td class="org-left"><b>name=phoneno</b></td>
</tr>

<tr>
<td class="org-left">If name is not present</td>
<td class="org-left"><b>Not found</b></td>
</tr>
</tbody>
</table>

<p>
Let’s to do it one-by-one:
</p>

<ul class="org-ul">
<li>get unknown no of names (<code>STRING</code>).</li>
</ul>

<div class="org-src-container">
<pre class="src src-java">&lt;&lt;&lt;&lt;&lt;&lt;&lt; HEAD
  <span style="color: #4f97d7; font-weight: bold;">while</span><span style="color: #4f97d7;">(</span>scan.hasNext<span style="color: #bc6ec5;">()</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span>
    <span style="color: #ce537a; font-weight: bold;">String</span> <span style="color: #7590db;">s</span> = scan.next<span style="color: #bc6ec5;">()</span>;
  <span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
