+posts/lang/java/hashmap.md


<a id="org4833985"></a>

# DONE The test case

Input:

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">3</td>
</tr>


<tr>
<td class="org-left">Raj 34745910</td>
</tr>


<tr>
<td class="org-left">Sonu 86988901</td>
</tr>


<tr>
<td class="org-left">Ravi 87240393</td>
</tr>


<tr>
<td class="org-left">Raju</td>
</tr>


<tr>
<td class="org-left">Ravi</td>
</tr>
</tbody>
</table>

Output:

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Not found</td>
</tr>


<tr>
<td class="org-left">Ravi=87240393</td>
</tr>
</tbody>
</table>


<a id="org3df976e"></a>

# DONE A humble solution


<a id="orgc0ef6b1"></a>

## Step - 1

Let’s create testMain class with main function and initialize `Scanner` and `Map`
classes:

    import java.util.*;
    import java.io.*;
    
    class testMain {
      public static void main(String []args) {
        Map<String, Integer> phoneBook = new HashMap<String, Integer>();
        Scanner scan = new Scanner(System.in);
      }
    }    


<a id="org11a6224"></a>

## Step - 2

Now let’s get the value of ’n’ (`INTEGER`) i.e. the no of phone records to be entered:

    int n = scan.nextInt();


<a id="org41d6111"></a>

## Step - 3

Now let’s fill ’n’ records (`STRING INTEGER`) in the phonebook.

    for(int i = 0; i < n; i++){
      String name = scan.next();
      int phone = scan.nextInt();
    
      phoneBook.put(name, phone);
    }

<div class="tip">
To put the data (name, phoneno) in the HashMap/phonebook, `put()` method is used.

**Syntax:**
       `put(Key, Value)`

</div>


<a id="org6683ec8"></a>

## Step - 4

Now comes a little tricky part:

1.  Get unknown no of names (`STRING`) from the user and for each of the these
    names, print:

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">If name is present in the phonebook</td>
<td class="org-left">**name=phoneno**</td>
</tr>


<tr>
<td class="org-left">If name is not present</td>
<td class="org-left">**Not found**</td>
</tr>
</tbody>
</table>

Let’s to do it one-by-one:

-   get unknown no of names (`STRING`).

    while(scan.hasNext()) {
      String s = scan.next();
    }
