+posts/lang/java/hashmap.org
** Step - 5
>>>>>>> 089941baa3b144514581895c2c4fa2031cc34755
- print the required output.

#+begin_src java
while(scan.hasNext()) {
  String s = scan.next();
  Integer phoneNumber = phoneBook.get(s);
  
  System.out.println((phoneNumber != null) ? s + "=" + phoneNumber : "Not found");
}
#+end_src

#+begin_tip
To get the data (phone no) from the HashMap, ~get()~ method is used.

*Syntax:*
       ~get(Key)~

<<<<<<< HEAD
So, ~phoneBook.get(Raj)~ will return the phone no of ’Raj’ if he’s
present. To check whether a Name/Key is present in the ~HashMap~ or not, ~HashMap~ uses ~equals()~ method internally.
#+end_tip

** Step - 6

=======
So, ~phoneBook.get(Raj)~ will return the phone no of ’Raj’ if he’s present. To
check whether a Name/Key is present in the ~HashMap~ or not, ~HashMap~ uses ~equals()~
method internally.
#+end_tip

** Step - 6
>>>>>>> 089941baa3b144514581895c2c4fa2031cc34755
Let’s connect the dots:

#+begin_src java
  import java.util.*;
  import java.io.*;

  class testMain {
    public static void main(String []args) {
      Map<String, Integer> phoneBook = new HashMap<String, Integer>();
      Scanner scan = new Scanner(System.in);

      int n = scan.nextInt();

      for(int i = 0; i < n; i++) {
        String name = scan.next();
        int phone = scan.nextInt();

        phoneBook.put(name, phone);
      }

      while(scan.hasNext()) {
        String s = scan.next();
        Integer phoneNumber = phoneBook.get(s);

        System.out.println((phoneNumber != null) ? s + "=" + phoneNumber : "Not found");
      }

      scan.close();
    }
  }
#+end_src

That’s it, the program to implement HashMap Logic in Java. I hope if not all,
we learned something :)

* Thank You!
