+posts/lang/java/hashmap.md


<a id="org2bdb882"></a>

## Step - 5

-   print the required output.

    while(scan.hasNext()) {
      String s = scan.next();
      Integer phoneNumber = phoneBook.get(s);
    
      System.out.println((phoneNumber != null) ? s + "=" + phoneNumber : "Not found");
    }

<div class="tip">
To get the data (phone no) from the HashMap, `get()` method is used.

**Syntax:**
       `get(Key)`

So, `phoneBook.get(Raj)` will return the phone no of ’Raj’ if he’s
present. To check whether a Name/Key is present in the `HashMap` or not, `HashMap` uses `equals()` method internally.

</div>


<a id="org863291f"></a>

## Step - 6

Let’s connect the dots:

    import java.util.*;
    import java.io.*;
    
    class testMain {
      public static void main(String []args) {
        Map<String, Integer> phoneBook = new HashMap<String, Integer>();
        Scanner scan = new Scanner(System.in);
    
        int n = scan.nextInt();
    
        for(int i = 0; i < n; i++) {
          String name = scan.next();
          int phone = scan.nextInt();
    
          phoneBook.put(name, phone);
        }
    
        while(scan.hasNext()) {
          String s = scan.next();
          Integer phoneNumber = phoneBook.get(s);
    
          System.out.println((phoneNumber != null) ? s + "=" + phoneNumber : "Not found");
        }
    
        scan.close();
      }
    }

That’s it, the program to implement HashMap Logic in Java. I hope if not all,
we learned something :)


<a id="orgecc7f31"></a>

# Thank You!

